; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v3)
             (pred_2 ?v10 ?v2)
             (pred_12 ?v4 ?v2)
             (pred_5 ?v8 ?v4 )
	     (pred_9 ?v4)
             (pred_1 ?v7)
             (pred_10 ?v10)
             (pred_8 ?v2)
             (pred_6 ?v4)
             (pred_4 ?v10)
             (pred_11 ?v4)
             (pred_7 ))



(:action op_3
:parameters (?v9 ?v6 ?v1 ?v11)
:precondition (and (pred_1 ?v9) (pred_1 ?v6) (pred_10 ?v1) (pred_8 ?v11)
          (pred_3 ?v9 ?v6) (pred_2 ?v1 ?v11)
                   (pred_12 ?v6 ?v11) (pred_9 ?v9) 
                   (pred_6 ?v6) (pred_4 ?v1))
:effect (and  (pred_11 ?v6) (not (pred_6 ?v6))))


(:action op_2
:parameters (?v9 ?v12)
:precondition (and (pred_1 ?v9) (pred_1 ?v12)
               (pred_9 ?v9) (pred_3 ?v9 ?v12) (pred_11 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v9))))

(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_1 ?v9) (pred_10 ?v1) 
                  (pred_9 ?v9) (pred_5 ?v1 ?v9) (pred_7 ))
:effect (and (pred_4 ?v1)
   (not (pred_5 ?v1 ?v9)) (not (pred_7 ))))


(:action op_1
:parameters (?v9 ?v13 ?v5)
:precondition (and (pred_1 ?v9) (pred_10 ?v13) (pred_10 ?v5)
                  (pred_9 ?v9) (pred_4 ?v5) (pred_5 ?v13 ?v9))
:effect (and (pred_4 ?v13) (pred_5 ?v5 ?v9)
        (not (pred_4 ?v5)) (not (pred_5 ?v13 ?v9))))

(:action op_5
:parameters (?v9 ?v1)
:precondition (and (pred_1 ?v9) (pred_10 ?v1) 
                  (pred_9 ?v9) (pred_4 ?v1))
:effect (and (pred_7 ) (pred_5 ?v1 ?v9) (not (pred_4 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_16 obj_12 obj_20 obj_10 obj_23 obj_03 obj_15 obj_09 obj_05 obj_21 obj_22 obj_04 obj_25 obj_14 obj_08 obj_06 obj_18 obj_30 obj_26 obj_29 obj_02 obj_27 obj_17 obj_13
    obj_28 obj_11
    obj_19 obj_01 obj_24
    )

    (:init
       (pred_7)

       (pred_1 obj_07)
       (pred_1 obj_16)
       (pred_1 obj_12)
       (pred_1 obj_20)
       (pred_1 obj_10)
       (pred_1 obj_23)
       (pred_1 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_21)
       (pred_1 obj_22)
       (pred_1 obj_04)
       (pred_1 obj_25)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_06)
       (pred_1 obj_18)
       (pred_1 obj_30)
       (pred_1 obj_26)
       (pred_1 obj_29)
       (pred_1 obj_02)
       (pred_1 obj_27)
       (pred_1 obj_17)
       (pred_1 obj_13)
       (pred_8 obj_28)
       (pred_8 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_01)
       (pred_10 obj_24)

       (pred_3 obj_07 obj_23)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_16 obj_03)
       (pred_3 obj_16 obj_12)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_16)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_23 obj_21)
       (pred_3 obj_23 obj_03)
       (pred_3 obj_23 obj_07)
       (pred_3 obj_03 obj_22)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_03 obj_23)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_03)
       (pred_3 obj_09 obj_25)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_05 obj_14)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_23)
       (pred_3 obj_22 obj_06)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_22 obj_03)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_04 obj_25)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_25 obj_30)
       (pred_3 obj_25 obj_14)
       (pred_3 obj_25 obj_09)
       (pred_3 obj_25 obj_04)
       (pred_3 obj_14 obj_26)
       (pred_3 obj_14 obj_05)
       (pred_3 obj_14 obj_25)
       (pred_3 obj_08 obj_29)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_06 obj_02)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_18 obj_27)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_30 obj_17)
       (pred_3 obj_30 obj_26)
       (pred_3 obj_30 obj_25)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_14)
       (pred_3 obj_26 obj_30)
       (pred_3 obj_29 obj_02)
       (pred_3 obj_29 obj_08)
       (pred_3 obj_02 obj_27)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_02 obj_29)
       (pred_3 obj_27 obj_17)
       (pred_3 obj_27 obj_18)
       (pred_3 obj_27 obj_02)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_30)
       (pred_3 obj_17 obj_27)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_13 obj_17)
       (pred_6 obj_25)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_12  obj_25 obj_28)
       (pred_12  obj_21 obj_11)
       (pred_12  obj_09 obj_28)
       (pred_11 obj_07)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_23)
       (pred_11 obj_03)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_22)
       (pred_11 obj_04)
       (pred_11 obj_14)
       (pred_11 obj_08)
       (pred_11 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_30)
       (pred_11 obj_26)
       (pred_11 obj_29)
       (pred_11 obj_02)
       (pred_11 obj_27)
       (pred_11 obj_17)
       (pred_11 obj_13)

       (pred_2  obj_19 obj_28)
       (pred_2  obj_01 obj_11)
       (pred_2  obj_24 obj_11)
       (pred_5 obj_19 obj_22)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_24 obj_03)
       (pred_9 obj_10)
    )

    (:goal (and
       (pred_5 obj_19 obj_30)
    ))
(:constraints
  (always (not (pred_9 obj_04)))
)
)

; plan
1. (op_2 obj_10 obj_20)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_20)
   goals met: 0 of 1
2. (op_2 obj_20 obj_12)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_12)
   goals met: 0 of 1
3. (op_2 obj_12 obj_15)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_15)
   goals met: 0 of 1
4. (op_2 obj_15 obj_03)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_03)
   goals met: 0 of 1
5. (op_2 obj_03 obj_22)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_22)
   goals met: 0 of 1
6. (op_4 obj_22 obj_19)
   deleted: (pred_5 obj_19 obj_22) (pred_7)
   added: (pred_4 obj_19)
   goals met: 0 of 1
7. (op_2 obj_22 obj_06)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_06)
   goals met: 0 of 1
8. (op_2 obj_06 obj_18)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_18)
   goals met: 0 of 1
9. (op_2 obj_18 obj_30)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_30)
   goals met: 0 of 1
10. (op_5 obj_30 obj_19)
   deleted: (pred_4 obj_19)
   added: (pred_7) (pred_5 obj_19 obj_30)
   goals met: 1 of 1
